minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
//#include <Ticker.h>

#include <ESP8266NetBIOS.h>
//#include <DNSServer.h>
//#include <ESP8266SSDP.h>

//#include <StreamString.h>
//#include <ESP8266WiFi.h>
//#include <ESP8266mDNS.h>
//#include <ArduinoOTA.h>
//#include <FS.h>
//#include <Hash.h>
//#include <ESPAsyncTCP.h>
//#include <ESPAsyncWebServer.h>
//#include <SPIFFSEditor.h>
//#include "AsyncJson.h"
//#include "ArduinoJson.h"
//#include "config.h"

#include "lwip/inet.h"

#include <pgmspace.h>
#include "asyncserver.h"
#include "buzzer.h"

#if defined(ARDUINO) && ARDUINO >= 100
#include "Arduino.h"
#else
#include "WProgram.h"
#endif

#define PRINTPORT Serial
#define DEBUGPORT Serial

#define RELEASE
#define RELEASEASYNCWS

#define PROGMEM_T __attribute__((section(".irom.text.template")))

#ifndef RELEASE
#define DEBUGLOG(fmt, ...)                    \
  {                                           \
    static const char pfmt[] PROGMEM_T = fmt; \
    DEBUGPORT.printf_P(pfmt, ##__VA_ARGS__);  \
  }
#else
#define DEBUGLOG(...)
#endif

#ifndef RELEASEASYNCWS
#define DEBUGASYNCWS(fmt, ...)                \
  {                                           \
    static const char pfmt[] PROGMEM_T = fmt; \
    DEBUGPORT.printf_P(pfmt, ##__VA_ARGS__);  \
  }
#else
#define DEBUGASYNCWS(...)
#endif

#define AP_ENABLE_BUTTON 4 // Button pin to enable AP during startup for configuration. -1 to disable
//#define CONFIG_FILE "/config.json"
#define USER_CONFIG_FILE "/userconfig.json"
#define GENERIC_CONFIG_FILE "/genericconfig.json"
#define SECRET_FILE "/secret.json"
#define RUNNING_TEXT_FILE "/runningtext.txt"
#define RUNNING_TEXT_FILE_2 "/runningtext_2.txt"
//#define CONFIG_FILE_MQTT "/configMqtt.json"

Ticker _secondTk;
Ticker tickerResetRestart;

//FS* _fs;
unsigned long wifiDisconnectedSince = 0;
String _browserMD5 = "";
uint32_t _updateSize = 0;

bool eventsourceTriggered = false;
bool wsConnected = false;
bool configNetworkUpdatedFlag = false;

WiFiEventHandler onStationModeConnectedHandler, onStationModeGotIPHandler, onStationModeDisconnectedHandler;
WiFiEventHandler stationConnectedHandler;
WiFiEventHandler stationDisconnectedHandler;
WiFiEventHandler probeRequestPrintHandler;
WiFiEventHandler probeRequestBlinkHandler;

bool wifiGotIpFlag = false;
bool wifiDisconnectedFlag = false;
bool stationConnectedFlag = false;
bool stationDisconnectedFlag = false;
bool resetESP = false;
bool restartESP = false;

bool firmwareUpdated = false;

// SKETCH BEGIN

FSInfo fs_info;

DNSServer dnsServer;

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
AsyncEventSource events("/events");

uint32_t clientID;

bool clientVisitConfigRunningLedPage = false;
bool clientVisitConfigSholatPage = false;
bool clientVisitConfigMqttPage = false;

bool clientVisitStatusNetworkPage = false;
bool clientVisitStatusTimePage = false;
bool clientVisitStatusSystemPage = false;
bool clientVisitSetTimePage = false;

bool clientVisitInfoPage = false;
bool clientVisitSholatTimePage = false;

void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
{
  if (type == WS_EVT_CONNECT)
  {
    DEBUGASYNCWS("ws[%s][%u] connect\r\n", server->url(), client->id());
    client->printf("Hello Client %u :)", client->id());
    client->ping();
    wsConnected = true;
    //wsSendTimeData();
    clientID = client->id();

    client->status();

    // reset state
    clientVisitConfigRunningLedPage = false;
    clientVisitConfigSholatPage = false;
    clientVisitConfigMqttPage = false;
    clientVisitStatusNetworkPage = false;
    clientVisitStatusTimePage = false;
    clientVisitStatusSystemPage = false;
    clientVisitInfoPage = false;
    clientVisitSholatTimePage = false;

    static uint32_t clientID_old = 0;
    if (clientID != clientID_old && clientID != 0)
    {
      DEBUGASYNCWS("New client is connected, ID  %d\r\n", clientID);

      // if old client exist, instruct old client to 'kill' its connection :)
      if (ws.hasClient(clientID_old))
      {
        DEBUGASYNCWS("Disconnect old client, ID %d\r\n", clientID_old);
        // ws.text(clientID_old, FPSTR(F("suicide")));

        //client->text(PSTR("text"));
        //const char flash_text[] PROGMEM = "Text to send";
        //client->text(FPSTR(flash_text));
        //const_cast<char *>(_config.deviceName.c_str());
        //const char flash_text[] PROGMEM = "Text to send";
        //ws.close(clientID_old, 1013, const_cast<char *>PSTR("text"));

        //String text = pgm_txt_serverloseconnection;
        //ws.close(clientID_old, 4000, const_cast<char *>(text.c_str()));

        int len = strlen_P(pgm_txt_serverloseconnection);
        char text[len];
        strcpy_P(text, pgm_txt_serverloseconnection);
        text[len] = '\0';
        ws.close(clientID_old, 4000, text);
      }

      clientID_old = clientID;
    }
    //zulu = client;
    //request->client()->remoteIP();
    //Serial.println(zulu->remoteIP());
    //Serial.println(client->request->url());
    //Serial.println(client->request->url().c_str());
    //AsyncWebHeader* h = request->getHeader(i);
    //AsyncWebServerRequest *request;
    //Serial.println(request->url().c_str());
  }
  else if (type == WS_EVT_DISCONNECT)
  {
    DEBUGASYNCWS("ws[%s][%u] disconnect: [%u\r\n", server->url(), client->id(), client->id());
    //_secondTk.detach();
    //eventsourceTriggered = false;
    wsConnected = false;
    //clientID = 0;
  }
  else if (type == WS_EVT_ERROR)
  {
    DEBUGASYNCWS("ws[%s][%u] error(%u): %s\r\n", server->url(), client->id(), *((uint16_t *)arg), (char *)data);
  }
  else if (type == WS_EVT_PONG)
  {
    DEBUGASYNCWS("ws[%s][%u] pong[%u]: %s\r\n", server->url(), client->id(), len, (len) ? (char *)data : "");
  }
  else if (type == WS_EVT_DATA)
  {
    AwsFrameInfo *info = (AwsFrameInfo *)arg;
    char msg[len + 1];
    msg[0] = '\0';
    if (info->final && info->index == 0 && info->len == len)
    {
      //the whole message is in a single frame and we got all of it's data
      DEBUGLOG("ws[%s][%u] %s-message[%lu]: ", server->url(), client->id(), (info->opcode == WS_TEXT) ? "text" : "binary", info->len);

      if (info->opcode == WS_TEXT)
      {
        client->text(FPSTR(pgm_txt_gotyourtextmessage));
      }
      else
      {
        client->binary(FPSTR(pgm_txt_gotyourbinarymessage));
      }

      if (info->opcode == WS_TEXT)
      {
        // check if start with '{' i.e. data in JSON format
        if (data[0] == '{')
        {
          StaticJsonBuffer<1024> jsonBuffer;
          JsonObject &root = jsonBuffer.parseObject(data);
          if (root.success())
          {
            //DEBUGLOG("JSON received: ");
            root.printTo(PRINTPORT);
            PRINT("\r\n");

            // check if JSON has certain key/parameter 'type'
            if (root[FPSTR(pgm_url)].success())
            {

              const char *url = root[FPSTR(pgm_url)];
              // int len = strlen(url);

              if (strcmp_P(url, pgm_statuspagenetwork) == 0)
              {
                clientVisitStatusNetworkPage = true;

                //  WsSendInfoStatic(clientID);
                //  WsSendInfoDynamic(clientID);
                //  //WsSendSholatStatic(clientID);
                //  //WsSendSholatDynamic(clientID);
                //  //WsSendRunningLedConfig(clientID);

