minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
                sendNetworkStatus(2);
              }
              else if (strcmp_P(url, pgm_statuspagetime) == 0)
              {
                clientVisitStatusTimePage = true;

                //  WsSendInfoStatic(clientID);
                //  WsSendInfoDynamic(clientID);
                //  //WsSendSholatStatic(clientID);
                //  //WsSendSholatDynamic(clientID);
                //  //WsSendRunningLedConfig(clientID);

                sendTimeStatus(2);
              }
              else if (strcmp_P(url, pgm_statuspagesystem) == 0)
              {
                clientVisitStatusSystemPage = true;

                //WsSendSystemStatus();

                //  WsSendInfoStatic(clientID);
                //  WsSendInfoDynamic(clientID);
                //  //WsSendSholatStatic(clientID);
                //  //WsSendSholatDynamic(clientID);
                //  //WsSendRunningLedConfig(clientID);
              }
              else if (strcmp_P(url, pgm_configpagesholat) == 0)
              {
                clientVisitConfigSholatPage = true;

                // WsSendConfigSholat();
              }
              else if (strcmp_P(url, pgm_configpageledmatrix) == 0)
              {
                clientVisitConfigRunningLedPage = true;

                //WsSendInfoStatic(clientID);
                //WsSendInfoDynamic(clientID);
                //WsSendSholatStatic(clientID);
                //WsSendSholatDynamic(clientID);
                //WsSendRunningLedConfig(clientID);
              }
              else if (strcmp_P(url, pgm_configpagemqtt) == 0)
              {
                clientVisitConfigMqttPage = true;

                //WsSendInfoStatic(clientID);
                //WsSendInfoDynamic(clientID);
                //WsSendSholatStatic(clientID);
                //WsSendSholatDynamic(clientID);
                //WsSendRunningLedConfig(clientID);
              }
              else if (strcmp_P(url, pgm_schedulepagesholat) == 0)
              {
                clientVisitSholatTimePage = true;

                //WsSendInfoStatic(clientID);
                //WsSendInfoDynamic(clientID);
                //WsSendSholatStatic(clientID);
                sendSholatSchedule(2);
                //WsSendRunningLedConfig(clientID);
              }
              else if (strcmp_P(url, pgm_settimepage) == 0)
              {
                clientVisitSetTimePage = true;

                //WsSendInfoStatic(clientID);
                //WsSendInfoDynamic(clientID);
                //WsSendSholatStatic(clientID);
                //WsSendSholatDynamic(clientID);
                //WsSendRunningLedConfig(clientID);
              }
            }

            //***********************
            // handle long text JSON
            //***********************
            if (root[FPSTR(pgm_longtext)].success())
            {
              const char *longtext = root[FPSTR(pgm_longtext)];

              File file = SPIFFS.open(RUNNING_TEXT_FILE, "w");

              if (!file)
              {
                DEBUGASYNCWS("Failed to open MQTT_PUBSUB config file\r\n");
                file.close();
                return;
              }

              for (uint16_t j = 0; j < strlen(longtext); j++)
              {
                file.write(longtext[j]);
              }
              file.close();
              tone1 = HIGH;
            }

            //******************************
            // handle SAVE CONFIG (not fast)
            //******************************
            if (root[FPSTR(pgm_saveconfig)].success())
            {

              const char *saveconfig = root[FPSTR(pgm_saveconfig)];
              //int len = root[FPSTR(pgm_saveconfig)].measureLength();

              //remove json key before saving
              root.remove(FPSTR(pgm_saveconfig));

              //******************************
              // save LOCATION config
              //******************************
              if (strcmp_P(saveconfig, pgm_configpagelocation) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open LOCATION config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                load_config_location();
                process_sholat();

                //beep
                tone1 = HIGH;
              }
              //******************************
              // save NETWORK config
              //******************************
              else if (strcmp_P(saveconfig, pgm_configpagenetwork) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open NETWORK config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                load_config_network();
                configNetworkUpdatedFlag = true;

                //beep
                tone1 = HIGH;
              }
              //******************************
              // save TIME config
              //******************************
              else if (strcmp_P(saveconfig, pgm_configpagetime) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfiletime), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open TIME config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                load_config_time();
                process_sholat();

                //beep
                tone1 = HIGH;
              }
              //******************************
              // save SHOLAT config
              //******************************
              else if (strcmp_P(saveconfig, pgm_configpagesholat) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open SHOLAT config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                load_config_sholat();
                process_sholat();

