minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
                //beep
                tone1 = HIGH;
              }
              //******************************
              // save LED MATRIX config
              //******************************
              else if (strcmp_P(saveconfig, pgm_configpageledmatrix) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open LED MATRIX config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                load_config_ledmatrix();

                //beep
                tone1 = HIGH;
              }
              //******************************
              // save Mqtt config
              //******************************
              else if (strcmp_P(saveconfig, pgm_configpagemqtt) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfilemqtt), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open MQTT config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                load_config_mqtt();

                //beep
                tone1 = HIGH;
              }

              //******************************
              // save MqttPubSub config
              //******************************
              else if (strcmp_P(saveconfig, pgm_configpagemqttpubsub) == 0)
              {
                File file = SPIFFS.open(FPSTR(pgm_configfilemqttpubsub), "w");

                if (!file)
                {
                  DEBUGASYNCWS("Failed to open MQTT_PUBSUB config file\r\n");
                  file.close();
                  return;
                }

                root.prettyPrintTo(file);
                file.flush();
                file.close();

                //beep
                tone1 = HIGH;
              }

              return;
            }

            //saveFastConfig; for led matrix settings page
            if (root[FPSTR(pgm_type)].success())
            {

              const char *type = root[FPSTR(pgm_type)];
              // int len = strlen(type);

              if (strcmp_P(type, pgm_matrixConfig) == 0)
              {

                const char *param = root[FPSTR(pgm_param)];
                const char *value = root[FPSTR(pgm_value)];
                // const char* text = root[FPSTR(pgm_text)];

                //int len = strlen(param);
                //int lenValue = strlen(value);

                if (strcmp_P(param, pgm_operatingmode) == 0)
                {
                  if (atoi(value) == 0)
                  {
                    _ledMatrixSettings.operatingmode = Normal;
                  }
                  else if (atoi(value) == 1)
                  {
                    _ledMatrixSettings.operatingmode = Config;
                  }
                  else if (atoi(value) == 2)
                  {
                    _ledMatrixSettings.operatingmode = Edit;
                  }
                  MODE = _ledMatrixSettings.operatingmode;
                }
                if (strcmp_P(param, pgm_pagemode0) == 0)
                {
                  _ledMatrixSettings.pagemode0 = atoi(value);
                  currentPageMode0 = _ledMatrixSettings.pagemode0;
                }
                if (strcmp_P(param, pgm_pagemode1) == 0)
                {
                  _ledMatrixSettings.pagemode1 = atoi(value);
                  currentPageMode1 = _ledMatrixSettings.pagemode1;
                }
                if (strcmp_P(param, pgm_pagemode2) == 0)
                {
                  _ledMatrixSettings.pagemode2 = atoi(value);
                  currentPageMode2 = _ledMatrixSettings.pagemode2;
                }
                if (strcmp_P(param, pgm_pagemode) == 0)
                {
                  if (strcmp_P(value, pgm_automatic) == 0)
                  {
                    _ledMatrixSettings.pagemode = Automatic;
                  }
                  if (strcmp_P(value, pgm_manual) == 0)
                  {
                    _ledMatrixSettings.pagemode = Manual;
                  }
                }
                if (strcmp_P(param, pgm_scrollrow_0) == 0)
                {
                  if (strcmp_P(value, pgm_true) == 0)
                  {
                    _ledMatrixSettings.scrollrow_0 = 1;
                  }
                  else
                  {
                    _ledMatrixSettings.scrollrow_0 = 0;
                  }
                }
                if (strcmp_P(param, pgm_scrollrow_1) == 0)
                {
                  if (strcmp_P(value, pgm_true) == 0)
                  {
                    _ledMatrixSettings.scrollrow_1 = 1;
                  }
                  else
                  {
                    _ledMatrixSettings.scrollrow_1 = 0;
                  }
                }
                if (strcmp_P(param, pgm_scrollspeedslider) == 0)
                {
                  _ledMatrixSettings.scrollspeed = atoi(value);
                }
                if (strcmp_P(param, pgm_brightnessslider) == 0)
                {
                  //_ledMatrixSettings.brightness = value.toInt();
                  _ledMatrixSettings.brightness = atoi(value);
                }
                if (strcmp_P(param, pgm_longtext) == 0)
                {
                  File runningTextFile = SPIFFS.open(RUNNING_TEXT_FILE, "w");
                  for (uint16_t j = 0; j < strlen(value); j++)
                  {
                    runningTextFile.write(value[j]);
                  }
                  runningTextFile.close();
                  tone1 = HIGH;
                }
                if (strcmp_P(param, pgm_btntesttone0) == 0)
                {
                  tone0 = HIGH;
                }
                if (strcmp_P(param, pgm_btntesttone1) == 0)
                {
                  tone1 = HIGH;
                }
                if (strcmp_P(param, pgm_btntesttone2) == 0)
                {
                  alarmState = HIGH;
                }
                if (strcmp_P(param, pgm_btntesttone10) == 0)
                {
                  tone10 = HIGH;
                }
                if (strcmp_P(param, pgm_btnsaveconfig) == 0)
                {
                  // config_save_runnningled();
                  tone1 = HIGH;
                }
              }
            }
          }
          else
          {
            // Parsing failed :-(
            DEBUGLOG("Parsing failed, not a JSON object or wrong JSON format.\r\n");
          }
        }
        else if (data[0] == 't' && data[1] == ' ')
        {
          char *token = strtok((char *)&data[2], " ");
          time_t utcTimestamp = (unsigned long)strtol(token, '\0', 10);

