minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
          RtcDateTime timeToSetToRTC;
          timeToSetToRTC.InitWithEpoch32Time(utcTimestamp);

          Rtc.SetDateTime(timeToSetToRTC);

          lastSyncRTC = utcTimestamp;

          setTime(utcTimestamp);
          _lastSyncd = utcTimestamp;

          DEBUGLOG("timeSync ");
        }
        else if (data[0] == 'm' && data[1] == ' ')
        {
          char *token = strtok((char *)&data[2], " ");
          time_t utcTimestamp = (unsigned long)strtol(token, '\0', 10);

          RtcDateTime timeToSetToRTC;
          timeToSetToRTC.InitWithEpoch32Time(utcTimestamp);

          Rtc.SetDateTime(timeToSetToRTC);

          lastSyncRTC = utcTimestamp;

          setTime(utcTimestamp);
          _lastSyncd = utcTimestamp;

          DEBUGLOG("timeSync ");
        }
        for (size_t i = 0; i < info->len; i++)
        {
          //msg += (char) data[i];
          char _data[2];
          _data[0] = (char)data[i];
          _data[1] = '\0';
          if (i == 0)
          {
            strcpy(msg, _data);
          }
          else
          {
            strcat(msg, _data);
          }
        }
      }
      else
      {
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          //msg += buff ;
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len + 1] = '\0';
      DEBUGASYNCWS("%s\r\n", msg);
    }
    else
    {
      //message is comprised of multiple frames or the frame is split into multiple packets
      if (info->index == 0)
      {
        if (info->num == 0)
          DEBUGASYNCWS("ws[%s][%u] %s-message start\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
        DEBUGASYNCWS("ws[%s][%u] frame[%u] start[%llu]\r\n", server->url(), client->id(), info->num, info->len);
      }

      DEBUGASYNCWS("ws[%s][%u] frame[%u] %s[%llu - %llu]: ", server->url(), client->id(), info->num, (info->message_opcode == WS_TEXT) ? "text" : "binary", info->index, info->index + len);

      if (info->opcode == WS_TEXT)
      {
        for (size_t i = 0; i < info->len; i++)
        {
          //msg += (char) data[i];
          //strcat(msg, const_cast<char*>((char)data[i]));
          char _data[2];
          _data[0] = (char)data[i];
          _data[1] = '\0';
          if (i == 0)
          {
            strcpy(msg, _data);
          }
          else
          {
            strcat(msg, _data);
          }
        }
      }
      else
      {
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          //msg += buff ;
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len + 1] = '\0';
      DEBUGASYNCWS("%s\r\n", msg);

      if ((info->index + len) == info->len)
      {
        DEBUGASYNCWS("ws[%s][%u] frame[%u] end[%llu]\r\n", server->url(), client->id(), info->num, info->len);
        if (info->final)
        {
          DEBUGASYNCWS("ws[%s][%u] %s-message end\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
          if (info->message_opcode == WS_TEXT)
            client->text(pgm_txt_gotyourtextmessage);
          else
            client->binary(pgm_txt_gotyourbinarymessage);
        }
      }
    }
  }
}

void AsyncWSBegin()
{
  DEBUGASYNCWS("Async WebServer Init...\r\n");

  // Register wifi Event to control connection LED
  onStationModeConnectedHandler = WiFi.onStationModeConnected([](WiFiEventStationModeConnected data) {
    onWiFiConnected(data);
  });
  onStationModeGotIPHandler = WiFi.onStationModeGotIP([](WiFiEventStationModeGotIP data) {
    onWifiGotIP(data);
  });
  // onStationModeGotIPHandler = WiFi.onStationModeGotIP(onWifiGotIP);
  onStationModeDisconnectedHandler = WiFi.onStationModeDisconnected([](WiFiEventStationModeDisconnected data) {
    onWiFiDisconnected(data);
  });

  // Register event handlers.
  // Callback functions will be called as long as these handler objects exist.
  // Call "onStationConnected" each time a station connects
  stationConnectedHandler = WiFi.onSoftAPModeStationConnected(&onStationConnected);
  // Call "onStationDisconnected" each time a station disconnects
  stationDisconnectedHandler = WiFi.onSoftAPModeStationDisconnected(&onStationDisconnected);
  // Call "onProbeRequestPrint" and "onProbeRequestBlink" each time
  // a probe request is received.
  // Former will print MAC address of the station and RSSI to Serial,
  // latter will blink an LED.
  probeRequestPrintHandler = WiFi.onSoftAPModeProbeRequestReceived(&onProbeRequestPrint);
  probeRequestBlinkHandler = WiFi.onSoftAPModeProbeRequestReceived(&onProbeRequestBlink);

  int reading = analogRead(A0);
  DEBUGASYNCWS("Analog Read: %d\r\n", reading);
  if (reading >= 768)
  {                            // analog read 3 volts or more
    _configAP.APenable = true; // Read AP button. If button is pressed, activate AP
    DEBUGASYNCWS("AP Enable = %d\r\n", _configAP.APenable);
  }

  //  if (!_fs) // If SPIFFS is not started
  //    _fs->begin();

  // SPIFFS.format();

  SPIFFS.begin();

  SPIFFS.info(fs_info);

  PRINT("totalBytes: %u\r\n", fs_info.totalBytes);
  PRINT("usedBytes: %u\r\n", fs_info.totalBytes);
  PRINT("blockSize: %u\r\n", fs_info.totalBytes);
  PRINT("pageSize: %u\r\n", fs_info.totalBytes);
  PRINT("maxOpenFiles: %u\r\n", fs_info.totalBytes);
  PRINT("maxPathLength: %u\r\n", fs_info.totalBytes);

  // start update firmware
  // Dir dir = SPIFFS.openDir("/");

  // pinMode(LED_BUILTIN, OUTPUT);
  // digitalWrite(LED_BUILTIN, LOW);

  if (SPIFFS.exists("/firmware.bin"))
  {
    File file = SPIFFS.open("/firmware.bin", "r");
    if (!file)
    {
      PRINT("Failed to open FIRMWARE file\r\n");
      file.close();
      return;
    }
    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH))
    { //start with max available size
      Update.printError(Serial);
      Serial.println("ERROR");
      file.close();
      return;
    }
    while (file.available())
    {
      uint8_t ibuffer[128];
      file.read((uint8_t *)ibuffer, 128);
      Serial.println((char *)ibuffer);
      Update.write(ibuffer, sizeof(ibuffer));
      // Serial.print("#");
    }
    Serial.print(Update.end(true));
    // digitalWrite(LED_BUILTIN, HIGH);
    file.close();
    SPIFFS.remove("/firmware.bin");
  }
  else
  {
    PRINT("Path to FIRMWARE file not exist.\r\n");
  }
  // end update firmware

#ifndef RELEASE
  { // List files
    //Dir dir = _fs->openDir("/");
    Dir dir = SPIFFS.openDir("/");
    while (dir.next())
    {
      String fileName = dir.fileName();
      size_t fileSize = dir.fileSize();

      PRINT("FS File: %s, size: %s\r\n", fileName.c_str(), formatBytes(fileSize));
    }
    PRINT("\r\n");
  }
#endif // RELEASE

  //save_config();

