minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  //Set the host name
  char bufPrefix[] = "SHOLAT_";
  char bufChipId[11];
  itoa(ESP.getChipId(), bufChipId, 10);

  //char bufHostName[32];
  strlcpy(_config.hostname, bufPrefix, sizeof(_config.hostname));
  strncat(_config.hostname, bufChipId, sizeof(bufChipId));

  if (!load_config_network())
  { // Try to load configuration from file system
    //defaultConfig(); // Load defaults if any error

    save_config_network();

    _configAP.APenable = true;
  }

  if (!load_config_location())
  {
    //create file if file not found
    save_config_location();
  }

  if (!load_config_time())
  {
    //create file if file not found
    save_config_time();
  }

  if (!load_config_sholat())
  {
    //create file if file not found
    save_config_sholat();
  }

  if (!load_config_ledmatrix())
  {
    //create file if file not found
    save_config_ledmatrix();
  }

  if (!load_config_httpauth())
  {
    //create file if file not found
  }

  //  loadHTTPAuth();

  // _configAP.APenable = true;

  // WiFi.persistent(true);
  // WiFi.mode(WIFI_OFF);

  bool autoConnect = false;
  WiFi.setAutoConnect(autoConnect);

  // bool autoReconnect = true;
  // WiFi.setAutoReconnect(autoReconnect);

  // WiFi.hostname(_config.hostname);

  if (_configAP.APenable || strcmp(_config.ssid, "") == 0)
  {
    PRINT("Starting wifi in WIFI_AP mode.\r\n");
    WiFi.mode(WIFI_OFF);
    // WiFi.mode(WIFI_AP); // bikin error
    WiFi.softAP(_configAP.ssid, _configAP.password);
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
  }
  else if (!_configAP.APenable)
  {
    if (!_config.dhcp)
    {
      PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\r\n");
      WiFi.mode(WIFI_OFF);
      // WiFi.mode(WIFI_STA);

      IPAddress static_ip;
      IPAddress gateway;
      IPAddress netmask;
      IPAddress dns0;
      IPAddress dns1;

      static_ip.fromString(_config.static_ip);
      gateway.fromString(_config.gateway);
      netmask.fromString(_config.netmask);
      dns0.fromString(_config.dns0);
      dns1.fromString(_config.dns1);

      WiFi.config(static_ip, gateway, netmask, dns0, dns1);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      WiFi.waitForConnectResult();
    }
    else
    {
      // WiFi.mode(WIFI_OFF);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      WiFi.waitForConnectResult();
    }
  }

  dnsServer.start(53, "*", WiFi.softAPIP());

  MDNS.addService("http", "tcp", 80);

  ArduinoOTA.setHostname(_config.hostname);
  ArduinoOTA.begin();

  NBNS.begin(_config.hostname);

  DEBUGASYNCWS("Starting SSDP...\r\n");
  SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  SSDP.setHTTPPort(80);
  SSDP.setDeviceType(FPSTR(pgm_upnprootdevice));
  //  SSDP.setModelName(_config.deviceName.c_str());
  //  SSDP.setModelNumber(FPSTR(modelNumber));
  SSDP.begin();

  // // SSDP.setSchemaURL("description.xml");
  // SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  // SSDP.setHTTPPort(80);
  // SSDP.setName("Philips hue clone");
  // SSDP.setSerialNumber("001788102201");
  // SSDP.setURL("index.html");
  // SSDP.setModelName("Philips hue bridge 2012");
  // SSDP.setModelNumber("929000226503");
  // SSDP.setModelURL("http://www.meethue.com");
  // SSDP.setManufacturer("Royal Philips Electronics");
  // SSDP.setManufacturerURL("http://www.philips.com");
  // SSDP.begin();

  //SPIFFS.begin();

  ws.onEvent(onWsEvent);

  server.addHandler(&ws);

  events.onConnect([](AsyncEventSourceClient *client) {
    //client->send("hello!", NULL, millis(), 1000);
    if (client->lastId())
    {
      DEBUGLOG("Client reconnected! Last message ID that it gat is: %u\r\n", client->lastId());
    }
    //send event with message "hello!", id current millis
    // and set reconnect delay to 1 second
    //client->send("hello!", NULL, millis(), 1000);
    client->send("hello!");
    //EVENTS_send_information_values_html(client);

    if (clientVisitStatusSystemPage)
    {
      //EventSendSystemStatus();
    }

    // eventsourceTriggered = true;

    //_secondTk.attach(1.0f, s_secondTick, static_cast<void*>(client)); // Task to run periodic things every second
    //SendTimeData();
    //SendSholatTime();
  });
  server.addHandler(&events);

  server.addHandler(new SPIFFSEditor());

  server.on("/list", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);
    handleFileList(request);
  });

  server.on("/description.xml", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

    File file = SPIFFS.open(DESCRIPTION_XML_FILE, "r");
    if (!file)
    {
      DEBUGASYNCWS("Failed to open config file\r\n");
      file.close();
      return;
    }

    size_t size = file.size();
    const uint16_t allocSize = 1024;
    DEBUGASYNCWS("DESCRIPTION_XML_FILE file size: %d bytes\r\n", size);
    if (size > allocSize)
    {
      DEBUGASYNCWS("DESCRIPTION_XML_FILE size is larger than %d size\r\n");
      file.close();
      return;
    }

    // Allocate a buffer to store contents of the file
    char buf[size];

    //copy file to buffer
    file.readBytes(buf, size);

    //add termination character at the end
    buf[size] = '\0';

    //close the file, save your memory, keep healthy :-)
    file.close();

    DEBUGASYNCWS("%s\r\n", buf);

    StreamString output;

    if (output.reserve(allocSize))
    {
      //convert IP address to char array
      size_t len = strlen(WiFi.localIP().toString().c_str());
      char URLBase[len + 1];
      strlcpy(URLBase, WiFi.localIP().toString().c_str(), sizeof(URLBase) / sizeof(URLBase[0]));

      // const char *friendlyName = WiFi.hostname().toString().c_str();
      len = strlen(WiFi.hostname().c_str());
      char friendlyName[len + 1];
      strlcpy(friendlyName, WiFi.hostname().c_str(), sizeof(friendlyName));

      char presentationURL[] = "/";
      uint32_t serialNumber = ESP.getChipId();
      char modelName[] = "LS-01";
      const char *modelNumber = friendlyName;
      //output.printf(ssdpTemplate,
      output.printf(buf,
                    URLBase,
                    friendlyName,
                    presentationURL,
                    serialNumber,
                    modelName,
                    modelNumber, //modelNumber
                    (uint8_t)((serialNumber >> 16) & 0xff),
                    (uint8_t)((serialNumber >> 8) & 0xff),
                    (uint8_t)serialNumber & 0xff);
      request->send(200, "text/xml", output);
    }
    else
    {
      request->send(500);
    }
  });

  // SSDP.schema(HTTP.client());

  server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.htm");

