minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  server.onNotFound([](AsyncWebServerRequest *request) {
    DEBUGLOG("NOT_FOUND: ");
    if (request->method() == HTTP_GET)
    {
      DEBUGLOG("GET");
    }
    else if (request->method() == HTTP_POST)
    {
      DEBUGLOG("POST");
    }
    else if (request->method() == HTTP_DELETE)
    {
      DEBUGLOG("DELETE");
    }
    else if (request->method() == HTTP_PUT)
    {
      DEBUGLOG("PUT");
    }
    else if (request->method() == HTTP_PATCH)
    {
      DEBUGLOG("PATCH");
    }
    else if (request->method() == HTTP_HEAD)
    {
      DEBUGLOG("HEAD");
    }
    else if (request->method() == HTTP_OPTIONS)
    {
      DEBUGLOG("OPTIONS");
    }
    else
    {
      DEBUGLOG("UNKNOWN");
    }
    DEBUGLOG("http://%s%s\r\n", request->host().c_str(), request->url().c_str());

    if (request->contentLength())
    {
      DEBUGLOG("_CONTENT_TYPE: %s\r\n", request->contentType().c_str());
      DEBUGLOG("_CONTENT_LENGTH: %u\r\n", request->contentLength());
    }

    int headers = request->headers();
    int i;
    for (i = 0; i < headers; i++)
    {
      AsyncWebHeader *h = request->getHeader(i);
      DEBUGASYNCWS("_HEADER[%s]: %s\r\n", h->name().c_str(), h->value().c_str());
    }

    int params = request->params();
    for (i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      {
        DEBUGLOG("_FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGLOG("_POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
      else
      {
        DEBUGLOG("_GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
    }

    request->send(404);
  });

  server.onFileUpload([](AsyncWebServerRequest *request, const String &filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index)
    {
      DEBUGLOG("UploadStart: %s\r\n", filename.c_str());
    }
    DEBUGLOG("%s", (const char *)data);
    if (final)
    {
      DEBUGLOG("UploadEnd: %s (%u)\r\n", filename.c_str(), index + len);
    }
  });

  server.onRequestBody([](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
    if (!index)
    {
      DEBUGLOG("BodyStart: %u\r\n", total);
    }
    DEBUGLOG("%s", (const char *)data);
    if (index + len == total)
    {
      DEBUGLOG("BodyEnd: %u\r\n", total);
    }
  });

  server.on("/scan", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    DynamicJsonBuffer jsonBuffer;
    JsonArray &root = jsonBuffer.createArray();

    int numberOfNetworks = WiFi.scanComplete();
    if (numberOfNetworks == -2)
    {                          //this may also works: WiFi.scanComplete() == WIFI_SCAN_FAILED
      WiFi.scanNetworks(true); //async enabled
    }
    else if (numberOfNetworks)
    {
      for (int i = 0; i < numberOfNetworks; ++i)
      {
        JsonObject &wifi = root.createNestedObject();
        wifi["ssid"] = WiFi.SSID(i);
        wifi["rssi"] = WiFi.RSSI(i);
        wifi["bssid"] = WiFi.BSSIDstr(i);
        wifi["channel"] = WiFi.channel(i);
        wifi["secure"] = WiFi.encryptionType(i);
        wifi["hidden"] = WiFi.isHidden(i) ? true : false;
      }
      WiFi.scanDelete();
      if (WiFi.scanComplete() == -2)
      { //this may also works: WiFi.scanComplete() == WIFI_SCAN_FAILED
        WiFi.scanNetworks(true);
      }
    }
    root.printTo(*response);
    request->send(response);
  });

  server.on("/admin/restart", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    request->send_P(200, "text/html", Page_WaitAndReload);
    restartESP = true;
  });

  server.on("/reset", [](AsyncWebServerRequest *request) {
    request->send_P(200, "text/html", Page_WaitAndReload);
    resetESP = true;
  });

  server.on("/admin/wwwauth", [](AsyncWebServerRequest *request) {
    send_wwwauth_configuration_values_html(request);
  });

  server.on("/system.html", [](AsyncWebServerRequest *request) {
    send_wwwauth_configuration_html(request);
  });

  server.on("/update/updatepossible", [](AsyncWebServerRequest *request) {
    send_update_firmware_values_html(request);
  });

  server.on("/setmd5", [](AsyncWebServerRequest *request) {
    setUpdateMD5(request);
  });

  server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->send(SPIFFS, "/update.html");
  });

  server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {
    const char* responseContent;
    if (Update.hasError())
    {
      responseContent = PSTR("FAIL");
    }
    else
    {
       responseContent = PSTR("<META http-equiv=\"refresh\" content=\"15;URL=/update\">Update correct. Restarting...");
    }
    AsyncWebServerResponse *response = request->beginResponse_P(200, "text/html", responseContent);
    
    response->addHeader("Connection", "close");
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response); },
            [](AsyncWebServerRequest *request, const String filename, size_t index, uint8_t *data, size_t len, bool final) { updateFirmware(request, filename, index, data, len, final); });

  server.on("/admin/connectionstate", [](AsyncWebServerRequest *request) {
    send_connection_state_values_html(request);
  });

  // server.on("/settime.html", [](AsyncWebServerRequest *request) {
  //   set_time_html(request);
  // });

  server.on("/config/network", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    send_config_network(request);
  });

  server.on("/config/location", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    send_config_location(request);
  });

  server.on("/config/time", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    send_config_time(request);
  });

  server.on("/config/sholat", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    send_config_sholat(request);
  });

  server.on("/config/ledmatrix", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    send_config_ledmatrix(request);
  });

