minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  server.on("/config/mqtt", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    send_config_mqtt(request);
  });

  server.on("/status/network", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    StaticJsonBuffer<1024> jsonBuffer;
    JsonObject &root = jsonBuffer.createObject();

    root[FPSTR(pgm_chipid)] = ESP.getChipId();
    root[FPSTR(pgm_hostname)] = WiFi.hostname();
    root[FPSTR(pgm_status)] = FPSTR(wifistatus_P[WiFi.status()]);

    root[FPSTR(pgm_mode)] = FPSTR(wifimode_P[WiFi.getMode()]);
    const char *phymodes[] = {"", "B", "G", "N"};
    root[FPSTR(pgm_phymode)] = phymodes[WiFi.getPhyMode()];
    root[FPSTR(pgm_channel)] = WiFi.channel();
    root[FPSTR(pgm_ssid)] = WiFi.SSID();
    root[FPSTR(pgm_password)] = WiFi.psk();
    root[FPSTR(pgm_encryption)] = WiFi.encryptionType(0);
    root[FPSTR(pgm_isconnected)] = WiFi.isConnected();
    root[FPSTR(pgm_autoconnect)] = WiFi.getAutoConnect();
    root[FPSTR(pgm_persistent)] = WiFi.getPersistent();
    root[FPSTR(pgm_bssid)] = WiFi.BSSIDstr();
    root[FPSTR(pgm_rssi)] = WiFi.RSSI();
    root[FPSTR(pgm_sta_ip)] = WiFi.localIP().toString();
    root[FPSTR(pgm_sta_mac)] = WiFi.macAddress();
    root[FPSTR(pgm_ap_ip)] = WiFi.softAPIP().toString();
    root[FPSTR(pgm_ap_mac)] = WiFi.softAPmacAddress();
    root[FPSTR(pgm_gateway)] = WiFi.gatewayIP().toString();
    root[FPSTR(pgm_netmask)] = WiFi.subnetMask().toString();
    root[FPSTR(pgm_dns0)] = WiFi.dnsIP().toString();
    root[FPSTR(pgm_dns1)] = WiFi.dnsIP(1).toString();

    size_t len = root.measureLength();
    char response[len + 1];
    root.printTo(response, sizeof(response));
    request->send(200, "text/plain", response);
  });

  server.on("/status/datetime", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    StaticJsonBuffer<512> jsonBuffer;
    JsonObject &root = jsonBuffer.createObject();

    root["d"] = day(localTime);
    root["m"] = month(localTime);
    root["y"] = year(localTime);
    root["hr"] = hour(localTime);
    root["min"] = minute(localTime);
    root["sec"] = second(localTime);
    root["tz"] = _configLocation.timezone;
    root["utc"] = utcTime;
    root["local"] = localTime;

    size_t len = root.measureLength();
    char response[len + 1];
    root.printTo(response, sizeof(response));
    request->send(200, "text/plain", response);
  });

  server.on("/status/heap", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    uint32_t heap = ESP.getFreeHeap();

    StaticJsonBuffer<64> jsonBuffer;
    JsonObject &root = jsonBuffer.createObject();

    root[FPSTR(pgm_heap)] = heap;

    size_t len = root.measureLength();
    char response[len + 1];
    root.printTo(response, sizeof(response));
    request->send(200, "application/json", response);
  });

  server.begin();
}

// -------------------------------------------------
// *** FUNCTIONS
// -------------------------------------------------
void onWiFiConnected(WiFiEventStationModeConnected data)
{
  PRINT("\r\nWifi Connected\r\n");
  wifiDisconnectedSince = 0;
  PRINT("WiFi status: %s\r\n", WiFi.status() == WL_CONNECTED ? "WL_CONNECTED" : String(WiFi.status()).c_str());
}

// Start NTP only after IP network is connected
void onWifiGotIP(WiFiEventStationModeGotIP ipInfo)
// void onWifiGotIP(const WiFiEventStationModeGotIP &event)
{
  wifiGotIpFlag = true;

  //Serial.printf_P(PSTR("\r\nWifi Got IP: %s\r\n"), ipInfo.ip.toString().c_str ());
  PRINT("\r\nWifi Got IP\r\n");
  // PRINT("IP Address:\t%s\r\n", WiFi.localIP().toString().c_str());
  PRINT("IP Address:\t%s\r\n", ipInfo.ip.toString().c_str());
}

void onWiFiDisconnected(WiFiEventStationModeDisconnected data)
{
  wifiDisconnectedFlag = true;
  PRINT("\r\nWifi disconnected.\r\n");
}

void onStationConnected(const WiFiEventSoftAPModeStationConnected &evt)
{
  stationConnectedFlag = true;

  PRINT("Station connected: %s\r\n", macToString(evt.mac));
}

void onStationDisconnected(const WiFiEventSoftAPModeStationDisconnected &evt)
{
  stationDisconnectedFlag = true;

  PRINT("Station disconnected: %s\r\n", macToString(evt.mac));
}

void onProbeRequestPrint(const WiFiEventSoftAPModeProbeRequestReceived &evt)
{
  PRINT("Probe request from: %s, RSSI: %d\r\n", macToString(evt.mac), evt.rssi);
}

void onProbeRequestBlink(const WiFiEventSoftAPModeProbeRequestReceived &)
{
  // We can't use "delay" or other blocking functions in the event handler.
  // Therefore we set a flag here and then check it inside "loop" function.
  // blinkFlag = true;
}

char *macToString(const unsigned char *mac)
{
  static char buf[20];
  snprintf(buf, sizeof(buf), "%02x:%02x:%02x:%02x:%02x:%02x",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return buf;
}

void handleFileList(AsyncWebServerRequest *request)
{
  if (!request->hasArg("dir"))
  {
    request->send(500, "text/plain", "BAD ARGS");
    return;
  }

  String path = request->arg("dir");
  DEBUGLOG("handleFileList: %s\r\n", path.c_str());
  Dir dir = SPIFFS.openDir(path);
  path = String();

  String output = "[";
  while (dir.next())
  {
    File entry = dir.openFile("r");
    if (true) //entry.name()!="secret.json") // Do not show secrets
    {
      if (output != "[")
        output += ',';
      bool isDir = false;
      output += "{\"type\":\"";
      output += (isDir) ? "dir" : "file";
      output += "\",\"name\":\"";
      output += String(entry.name()).substring(1);
      output += "\"}";
    }
    entry.close();
  }

  output += "]";
  DEBUGLOG("%s\r\n", output.c_str());
  request->send(200, "application/json", output);
}

void send_network_configuration_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File configFile = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!configFile)
  {
    DEBUGASYNCWS("Failed to open config file");
    return;
  }

  size_t size = configFile.size();
  DEBUGLOG("JSON file size: %d bytes\r\n", size);
  char buf[size];
  configFile.readBytes(buf, size);
  buf[size] = '\0';
  configFile.close();

  request->send(200, "text/plain", buf);
}

void send_connection_state_values_html(AsyncWebServerRequest *request)
{
  String state = "N/A";
  String Networks = "";
  if (WiFi.status() == 0)
    state = "Idle";
  else if (WiFi.status() == 1)
    state = "NO SSID AVAILBLE";
  else if (WiFi.status() == 2)
    state = "SCAN COMPLETED";
  else if (WiFi.status() == 3)
    state = "CONNECTED";
  else if (WiFi.status() == 4)
    state = "CONNECT FAILED";
  else if (WiFi.status() == 5)
    state = "CONNECTION LOST";
  else if (WiFi.status() == 6)
    state = "DISCONNECTED";

  WiFi.scanNetworks(true);

  String values = "";
  values += "connectionstate|" + state + "|div\r\n";
  //values += "networks|Scanning networks ...|div\r\n";
  request->send(200, "text/plain", values);
  state = "";
  values = "";
  Networks = "";
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
}

void sendNetworkStatus(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

