minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_chipid)] = ESP.getChipId();
  root[FPSTR(pgm_hostname)] = _config.hostname;
  uint8_t wifiMode = WiFi.getMode();
  if (wifiMode == WIFI_AP)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP);
  }
  else if (wifiMode == WIFI_STA)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_STA);
  }
  else if (wifiMode == WIFI_AP_STA)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP_STA);
  }
  else if (wifiMode == WIFI_OFF)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_OFF);
  }
  else
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_NA);
  }
  root[FPSTR(pgm_ssid)] = WiFi.SSID();
  root[FPSTR(pgm_sta_ip)] = WiFi.localIP().toString();
  root[FPSTR(pgm_sta_mac)] = WiFi.macAddress();
  root[FPSTR(pgm_ap_ip)] = WiFi.softAPIP().toString();
  root[FPSTR(pgm_ap_mac)] = WiFi.softAPmacAddress();
  root[FPSTR(pgm_gateway)] = WiFi.gatewayIP().toString();
  root[FPSTR(pgm_netmask)] = WiFi.subnetMask().toString();
  root[FPSTR(pgm_dns0)] = WiFi.dnsIP().toString();
  root[FPSTR(pgm_dns1)] = WiFi.dnsIP(1).toString();

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void sendTimeStatus(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_date)] = getDateStr(localTime);
  root[FPSTR(pgm_time)] = getTimeStr(localTime);
  root[FPSTR(pgm_uptime)] = getUptimeStr();
  if (_lastSyncd != 0)
  {
    root[FPSTR(pgm_lastsync)] = getLastSyncStr();
    root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  }
  else
  {
    root[FPSTR(pgm_lastsync)] = FPSTR(pgm_never);
    root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  }

  root["ping_seq_num_send"] = ping_seq_num_send;
  root["ping_seq_num_recv"] = ping_seq_num_recv;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

int apgm_lastIndexOf(uint8_t c, const char *p)
{
  int last_index = -1; // -1 indicates no match
  uint8_t b;
  for (int i = 0; true; i++)
  {
    b = pgm_read_byte(p++);
    if (b == c)
      last_index = i;
    else if (b == 0)
      break;
  }
  return last_index;
}

void sendHeap(uint8_t mode)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  StaticJsonBuffer<128> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_heap)] = heap;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void sendDateTime(uint8_t mode)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root["d"] = day(localTime);
  root["m"] = month(localTime);
  root["y"] = year(localTime);
  root["hr"] = hour(localTime);
  root["min"] = minute(localTime);
  root["sec"] = second(localTime);
  root["tz"] = _configLocation.timezone;
  root["utc"] = utcTime;
  root["local"] = localTime;

  size_t len = root.measurePrettyLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
    // events.send(buf, "timeDate", millis());
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void restart_1()
{
  // digitalWrite(0, HIGH); //GPIO0
  // digitalWrite(2, HIGH); //GPIO2
  // digitalWrite(15, LOW); //GPIO15
  ESP.restart();
}

void reset_1()
{
  // digitalWrite(0, HIGH); //GPIO0
  // digitalWrite(2, HIGH); //GPIO2
  // digitalWrite(15, LOW); //GPIO15
  ESP.reset();
  //ESP.restart();
}

void send_wwwauth_configuration_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();
  if (_httpAuth.auth)
  {
    root[FPSTR(pgm_wwwauth)] = true;
  }
  else
  {
    root[FPSTR(pgm_wwwauth)] = false;
  }
  root[FPSTR(pgm_wwwuser)] = _httpAuth.wwwUsername;
  root[FPSTR(pgm_wwwpass)] = _httpAuth.wwwPassword;

  AsyncResponseStream *response = request->beginResponseStream("text/plain");
  root.printTo(*response);
  request->send(response);
}

void send_wwwauth_configuration_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s %d\r\n", __FUNCTION__, request->args());

  //List all parameters
  int params = request->params();
  if (params)
  {
    for (int i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      { //p->isPost() is also true
        DEBUGASYNCWS("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGASYNCWS("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        //      if (p->name() == "wwwauth") {
        //        _httpAuth.auth = p->value();
        //      }
        if (request->hasParam("wwwauth", true))
        {
          if (p->name() == "wwwauth")
          {
            _httpAuth.auth = p->value();
          }
          if (p->name() == "wwwuser")
          {
            strlcpy(_httpAuth.wwwUsername, p->value().c_str(), sizeof(_httpAuth.wwwUsername));
          }
          if (p->name() == "wwwpass")
          {
            strlcpy(_httpAuth.wwwPassword, p->value().c_str(), sizeof(_httpAuth.wwwPassword));
          }
        }
      }
      else
      {
        DEBUGASYNCWS("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
    }
  }
  else
  {
    _httpAuth.auth = false;
  }

  //save settings
  saveHTTPAuth();

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwauth", true))
  //   AsyncWebParameter* p = request->getParam("wwwauth", true);

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwuser", true))
  //   AsyncWebParameter* p = request->getParam("wwwuser", true);

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwpass", true))
  //   AsyncWebParameter* p = request->getParam("wwwpass", true);

  request->send(SPIFFS, request->url());
}

bool saveHTTPAuth()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();
  json[FPSTR(pgm_wwwauth)] = _httpAuth.auth;
  json[FPSTR(pgm_wwwuser)] = _httpAuth.wwwUsername;
  json[FPSTR(pgm_wwwpass)] = _httpAuth.wwwPassword;

  //TODO add AP data to html
  File file = SPIFFS.open(SECRET_FILE, "w");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open secret file for writing\r\n");
    file.close();
    return false;
  }

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif // RELEASE

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

void send_update_firmware_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);
  String values = "";
  uint32_t freeSketchSpace = ESP.getFreeSketchSpace();
  uint32_t maxSketchSpace = (ESP.getSketchSize() - 0x1000) & 0xFFFFF000;
  //bool updateOK = Update.begin(maxSketchSpace);
  bool updateOK = maxSketchSpace < freeSketchSpace;
  StreamString result;
  Update.printError(result);
  DEBUGASYNCWS("--FreeSketchSpace: %d\r\n", freeSketchSpace);
  DEBUGASYNCWS("--MaxSketchSpace: %d\r\n", maxSketchSpace);
  DEBUGASYNCWS("--Update error = %s\r\n", result.c_str());
  values += "remupd|" + (String)((updateOK) ? "OK" : "ERROR") + "|div\n";

  if (Update.hasError())
  {
    result.trim();
    values += "remupdResult|" + result + "|div\n";
  }
  else
  {
    values += "remupdResult||div\n";
  }

  request->send(200, "text/plain", values);
}

void setUpdateMD5(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s %d\r\n", __FUNCTION__, request->args());

  const char *browserMD5 = nullptr;

