minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  int params = request->params();
  if (params)
  {
    for (int i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      { //p->isPost() is also true
        DEBUGASYNCWS("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGASYNCWS("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        if (request->hasParam("md5", true))
        {
          if (p->name() == "md5")
          {
            browserMD5 = p->value().c_str();
            Update.setMD5(browserMD5);
          }
          if (p->name() == "size")
          {
            _updateSize = atoi(p->value().c_str());
            DEBUGASYNCWS("Update size: %u\r\n", _updateSize);
          }
        }
      }
      else
      {
        DEBUGASYNCWS("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        if (request->hasParam("md5"))
        {
          if (p->name() == "md5")
          {
            browserMD5 = p->value().c_str();
            Update.setMD5(browserMD5);
          }
          if (p->name() == "size")
          {
            _updateSize = atoi(p->value().c_str());
            DEBUGASYNCWS("Update size: %u\r\n", _updateSize);
          }
        }
      }
    }

    if (browserMD5 != nullptr)
    {
      char buf[64] = "OK --> MD5: ";
      strncat(buf, browserMD5, sizeof(buf));
      request->send(200, "text/html", buf);
      return;
    }
    else
    {
      request->send_P(500, "text/html", PSTR("Error: MD5 is NULL"));
      return;
    }
  }
  request->send_P(200, "text/html", PSTR("Empty Parameter"));
}

void updateFirmware(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
{
  // handler for the file upload, get's the sketch bytes, and writes
  // them through the Update object
  static unsigned long totalSize = 0;
  if (!index)
  { //UPLOAD_FILE_START
    // SPIFFS.end();
    Update.runAsync(true);
    DEBUGASYNCWS("Update start: %s\r\n", filename.c_str());
    uint32_t maxSketchSpace = ESP.getSketchSize();
    DEBUGASYNCWS("Max free scketch space: %u\r\n", maxSketchSpace);
    DEBUGASYNCWS("New scketch size: %u\r\n", _updateSize);
    if (_browserMD5 != NULL && _browserMD5 != "")
    {
      Update.setMD5(_browserMD5.c_str());
      DEBUGASYNCWS("Hash from client: %s\r\n", _browserMD5.c_str());
    }
    if (!Update.begin(_updateSize))
    { //start with max available size
      Update.printError(DEBUGPORT);
    }
  }

  // Get upload file, continue if not start
  totalSize += len;
  DEBUGASYNCWS(".");
  size_t written = Update.write(data, len);
  if (written != len)
  {
    DEBUGASYNCWS("len = %d, written = %zu, totalSize = %lu\r\n", len, written, totalSize);
    //Update.printError(PRINTPORT);
    //return;
  }
  if (final)
  { // UPLOAD_FILE_END
    String updateHash;
    DEBUGASYNCWS("\r\nApplying update...\r\n");
    if (Update.end(true))
    { //true to set the size to the current progress
      updateHash = Update.md5String();
      DEBUGASYNCWS("Upload finished. Calculated MD5: %s\r\n", updateHash.c_str());
      DEBUGASYNCWS("Update Success: %u\r\nRebooting...\r\n", request->contentLength());
      // SPIFFS.end();
      // mqttClient.disconnect();
      // WiFi.mode(WIFI_OFF);
      // restartESP.attach(1.0f, restart_1);
      // restartESP.attach(1.0f, reset_1);
      firmwareUpdated = true;
    }
    else
    {
      updateHash = Update.md5String();
      DEBUGASYNCWS("Upload failed. Calculated MD5: %s\r\n", updateHash.c_str());
      Update.printError(PRINTPORT);
    }
  }

  //delay(2);
}

void send_config_network(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_hostname)] = _config.hostname;
  root[FPSTR(pgm_ssid)] = _config.ssid;
  root[FPSTR(pgm_password)] = _config.password;
  root[FPSTR(pgm_dhcp)] = _config.dhcp;
  root[FPSTR(pgm_static_ip)] = _config.static_ip;
  root[FPSTR(pgm_netmask)] = _config.netmask;
  root[FPSTR(pgm_gateway)] = _config.gateway;
  root[FPSTR(pgm_dns0)] = _config.dns0;
  root[FPSTR(pgm_dns1)] = _config.dns1;

  root.prettyPrintTo(*response);
  request->send(response);
}

void send_config_location(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_city)] = _configLocation.city;
  root[FPSTR(pgm_timezone)] = _configLocation.timezone;
  root[FPSTR(pgm_latitude)] = _configLocation.latitude;
  root[FPSTR(pgm_longitude)] = _configLocation.longitude;

  root.prettyPrintTo(*response);
  request->send(response);
}

void send_config_time(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_dst)] = _configTime.dst;
  root[FPSTR(pgm_enablertc)] = _configTime.enablertc;
  root[FPSTR(pgm_enablentp)] = _configTime.enablentp;
  root[FPSTR(pgm_ntpserver_0)] = _configTime.ntpserver_0;
  root[FPSTR(pgm_ntpserver_1)] = _configTime.ntpserver_1;
  root[FPSTR(pgm_ntpserver_2)] = _configTime.ntpserver_2;
  root[FPSTR(pgm_syncinterval)] = _configTime.syncinterval;

  root.prettyPrintTo(*response);
  request->send(response);
}

void send_config_sholat(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  // root[FPSTR(pgm_province)] = _config.province;
  root[FPSTR(pgm_city)] = _configLocation.city;
  root[FPSTR(pgm_timezone)] = _configLocation.timezone;
  root[FPSTR(pgm_latitude)] = _configLocation.latitude;
  root[FPSTR(pgm_longitude)] = _configLocation.longitude;

  // calcMethod
  if (_sholatConfig.calcMethod == Jafari)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Jafari);
  }
  else if (_sholatConfig.calcMethod == Karachi)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Karachi);
  }
  else if (_sholatConfig.calcMethod == ISNA)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_ISNA);
  }
  else if (_sholatConfig.calcMethod == MWL)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_MWL);
  }
  else if (_sholatConfig.calcMethod == Makkah)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Makkah);
  }
  else if (_sholatConfig.calcMethod == Egypt)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Egypt);
  }
  else if (_sholatConfig.calcMethod == Custom)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Custom);
  }

  //asrMethod
  if (_sholatConfig.asrJuristic == Shafii)
  {
    root[FPSTR(pgm_asrJuristic)] = FPSTR(pgm_Shafii);
  }
  else if (_sholatConfig.asrJuristic == Hanafi)
  {
    root[FPSTR(pgm_asrJuristic)] = FPSTR(pgm_Hanafi);
  }

