minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  // highLatsAdjustMethod
  //uint8_t highLatsAdjustMethod = root[FPSTR(pgm_highLatsAdjustMethod)];
  if (_sholatConfig.highLatsAdjustMethod == None)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_None);
  }
  else if (_sholatConfig.highLatsAdjustMethod == MidNight)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_MidNight);
  }
  else if (_sholatConfig.highLatsAdjustMethod == OneSeventh)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_OneSeventh);
  }
  else if (_sholatConfig.highLatsAdjustMethod == AngleBased)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_AngleBased);
  }

  root[FPSTR(pgm_fajrAngle)] = _sholatConfig.fajrAngle;
  root[FPSTR(pgm_maghribAngle)] = _sholatConfig.maghribAngle;
  root[FPSTR(pgm_ishaAngle)] = _sholatConfig.ishaAngle;
  root[FPSTR(pgm_offsetImsak)] = _sholatConfig.offsetImsak;
  root[FPSTR(pgm_offsetFajr)] = _sholatConfig.offsetFajr;
  root[FPSTR(pgm_offsetSunrise)] = _sholatConfig.offsetSunrise;
  root[FPSTR(pgm_offsetDhuhr)] = _sholatConfig.offsetDhuhr;
  root[FPSTR(pgm_offsetAsr)] = _sholatConfig.offsetAsr;
  root[FPSTR(pgm_offsetSunset)] = _sholatConfig.offsetSunset;
  root[FPSTR(pgm_offsetMaghrib)] = _sholatConfig.offsetMaghrib;
  root[FPSTR(pgm_offsetIsha)] = _sholatConfig.offsetIsha;

  root.prettyPrintTo(*response);
  request->send(response);
}

void send_config_ledmatrix(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  // root[FPSTR(pgm_type)] = FPSTR(pgm_matrixconfig);
  root[FPSTR(pgm_pagemode0)] = _ledMatrixSettings.pagemode0;
  root[FPSTR(pgm_pagemode1)] = _ledMatrixSettings.pagemode1;
  root[FPSTR(pgm_pagemode2)] = _ledMatrixSettings.pagemode2;
  root[FPSTR(pgm_scrollrow_0)] = _ledMatrixSettings.scrollrow_0;
  root[FPSTR(pgm_scrollrow_1)] = _ledMatrixSettings.scrollrow_1;
  root[FPSTR(pgm_scrollspeed)] = _ledMatrixSettings.scrollspeed;
  root[FPSTR(pgm_brightness)] = _ledMatrixSettings.brightness;

  char temp[4];
  root[FPSTR(pgm_operatingmode)] = itoa(_ledMatrixSettings.operatingmode, temp, 10);
  if (_ledMatrixSettings.pagemode == Automatic)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_automatic);
  }
  else if (_ledMatrixSettings.pagemode == Manual)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_manual);
  }

  root[FPSTR(pgm_adzanwaittime)] = _ledMatrixSettings.adzanwaittime;
  root[FPSTR(pgm_iqamahwaittime)] = _ledMatrixSettings.iqamahwaittime;

  root.prettyPrintTo(*response);
  request->send(response);
}

void send_config_mqtt(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_mqtt_enabled)] = configMqtt.enabled;
  root[FPSTR(pgm_mqtt_server)] = configMqtt.server;
  root[FPSTR(pgm_mqtt_port)] = configMqtt.port;
  root[FPSTR(pgm_mqtt_user)] = configMqtt.user;
  root[FPSTR(pgm_mqtt_pass)] = configMqtt.pass;
  root[FPSTR(pgm_mqtt_clientid)] = _config.hostname;
  root[FPSTR(pgm_mqtt_keepalive)] = configMqtt.keepalive;
  root[FPSTR(pgm_mqtt_cleansession)] = configMqtt.cleansession;
  root[FPSTR(pgm_mqtt_lwttopicprefix)] = configMqtt.lwttopicprefix;
  root[FPSTR(pgm_mqtt_lwtqos)] = configMqtt.lwtqos;
  root[FPSTR(pgm_mqtt_lwtretain)] = configMqtt.lwtretain;
  root[FPSTR(pgm_mqtt_lwtpayload)] = configMqtt.lwtpayload;

  root.prettyPrintTo(*response);
  request->send(response);
}

void sendConfigSholat(uint8_t mode)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_location)] = _configLocation.city;
  root[FPSTR(pgm_latitude)] = _configLocation.latitude;
  root[FPSTR(pgm_longitude)] = _configLocation.longitude;
  root[FPSTR(pgm_timezone)] = _configLocation.timezone;

  // calcMethod
  if (_sholatConfig.calcMethod == Jafari)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Jafari);
  }
  else if (_sholatConfig.calcMethod == Karachi)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Karachi);
  }
  else if (_sholatConfig.calcMethod == ISNA)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_ISNA);
  }
  else if (_sholatConfig.calcMethod == MWL)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_MWL);
  }
  else if (_sholatConfig.calcMethod == Makkah)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Makkah);
  }
  else if (_sholatConfig.calcMethod == Egypt)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Egypt);
  }
  else if (_sholatConfig.calcMethod == Custom)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Custom);
  }

  //asrMethod
  if (_sholatConfig.asrJuristic == Shafii)
  {
    root[FPSTR(pgm_asrJuristic)] = 0;
  }
  else if (_sholatConfig.asrJuristic == Hanafi)
  {
    root[FPSTR(pgm_asrJuristic)] = 1;
  }

  // highLatsAdjustMethod
  if (_sholatConfig.highLatsAdjustMethod == None)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 0;
  }
  else if (_sholatConfig.highLatsAdjustMethod == MidNight)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 1;
  }
  else if (_sholatConfig.highLatsAdjustMethod == OneSeventh)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 2;
  }
  else if (_sholatConfig.highLatsAdjustMethod == AngleBased)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 3;
  }

  root[FPSTR(pgm_fajrAngle)] = _sholatConfig.fajrAngle;
  root[FPSTR(pgm_maghribAngle)] = _sholatConfig.maghribAngle;
  root[FPSTR(pgm_ishaAngle)] = _sholatConfig.ishaAngle;
  root[FPSTR(pgm_offsetImsak)] = _sholatConfig.offsetImsak;
  root[FPSTR(pgm_offsetFajr)] = _sholatConfig.offsetFajr;
  root[FPSTR(pgm_offsetSunrise)] = _sholatConfig.offsetSunrise;
  root[FPSTR(pgm_offsetDhuhr)] = _sholatConfig.offsetDhuhr;
  root[FPSTR(pgm_offsetAsr)] = _sholatConfig.offsetAsr;
  root[FPSTR(pgm_offsetSunset)] = _sholatConfig.offsetSunset;
  root[FPSTR(pgm_offsetMaghrib)] = _sholatConfig.offsetMaghrib;
  root[FPSTR(pgm_offsetIsha)] = _sholatConfig.offsetIsha;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void set_time_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  //List all parameters
  int params = request->params();
  for (int i = 0; i < params; i++)
  {
    AsyncWebParameter *p = request->getParam(i);
    if (p->isFile())
    { //p->isPost() is also true
      Serial.printf("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
    }
    else if (p->isPost())
    {
      Serial.printf("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
    }
    else
    {
      Serial.printf("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
    }
  }

  // //Check if GET parameter exists
  // if (request->hasParam("download"))
  //   AsyncWebParameter* p = request->getParam("download");

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("download", true))
  //   AsyncWebParameter* p = request->getParam("download", true);

