minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  // //Check if FILE was uploaded
  // if (request->hasParam("download", true, true))
  //   AsyncWebParameter* p = request->getParam("download", true, true);

  //handleFileRead("/setrtctime.html", request);
  request->send(SPIFFS, request->url());
}

bool load_config_location()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config LOCATION file\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("config LOCATION file size: %d bytes\r\n", size);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);
  file.close();

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config LOCATION file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
#endif

  strlcpy(_configLocation.city, root[FPSTR(pgm_city)], sizeof(_configLocation.city));
  _configLocation.timezone = root[FPSTR(pgm_timezone)];
  _configLocation.latitude = root[FPSTR(pgm_latitude)];
  _configLocation.longitude = root[FPSTR(pgm_longitude)];

  DEBUGASYNCWS("\r\nConfig LOCATION loaded successfully.\r\n");
  DEBUGASYNCWS("city: %s\r\n", _configLocation.city);
  DEBUGASYNCWS("timezone: %d\r\n", _configLocation.timezone);
  DEBUGASYNCWS("latitude: %f\r\n", _configLocation.latitude);
  DEBUGASYNCWS("longitude: %f\r\n", _configLocation.longitude);

  return true;
}

bool load_config_network()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\r\n");
    file.close();
    return false;
  }

  // size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", file.size());

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);

  file.close();

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config NETWORK file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  config_setup();

  // strlcpy(_config.hostname, root[FPSTR(pgm_hostname)], sizeof(_config.hostname));
  strlcpy(_config.ssid, root[FPSTR(pgm_ssid)], sizeof(_config.ssid));
  strlcpy(_config.password, root[FPSTR(pgm_password)], sizeof(_config.password));
  _config.dhcp = root[FPSTR(pgm_dhcp)];
  strlcpy(_config.static_ip, root[FPSTR(pgm_static_ip)], sizeof(_config.static_ip));
  strlcpy(_config.netmask, root[FPSTR(pgm_netmask)], sizeof(_config.netmask));
  strlcpy(_config.gateway, root[FPSTR(pgm_gateway)], sizeof(_config.gateway));
  strlcpy(_config.dns0, root[FPSTR(pgm_dns0)], sizeof(_config.dns0));
  strlcpy(_config.dns1, root[FPSTR(pgm_dns1)], sizeof(_config.dns1));

  DEBUGASYNCWS("\r\nNetwork settings loaded successfully.\r\n");
  DEBUGASYNCWS("hostname: %s\r\n", _config.hostname);
  DEBUGASYNCWS("ssid: %s\r\n", _config.ssid);
  DEBUGASYNCWS("pass: %s\r\n", _config.password);
  DEBUGASYNCWS("dhcp: %d\r\n", _config.dhcp);
  DEBUGASYNCWS("static_ip: %s\r\n", _config.static_ip);
  DEBUGASYNCWS("netmask: %s\r\n", _config.netmask);
  DEBUGASYNCWS("gateway: %s\r\n", _config.gateway);
  DEBUGASYNCWS("dns0: %s\r\n", _config.dns0);
  DEBUGASYNCWS("dns1: %s\r\n", _config.dns1);

  return true;
}

bool load_config_time()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfiletime), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config TIME file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("config TIME file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config TIME file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");

#endif

  _configTime.dst = root[FPSTR(pgm_dst)];
  _configTime.enablertc = root[FPSTR(pgm_enablertc)];
  _configTime.enablentp = root[FPSTR(pgm_enablentp)];
  strlcpy(_configTime.ntpserver_0, root[FPSTR(pgm_ntpserver_0)], sizeof(_configTime.ntpserver_0));
  strlcpy(_configTime.ntpserver_1, root[FPSTR(pgm_ntpserver_1)], sizeof(_configTime.ntpserver_1));
  strlcpy(_configTime.ntpserver_2, root[FPSTR(pgm_ntpserver_2)], sizeof(_configTime.ntpserver_2));
  _configTime.syncinterval = root[FPSTR(pgm_syncinterval)];

  //check
  DEBUGASYNCWS("Time settings loaded successfully.\r\n");
  DEBUGASYNCWS("dst: %d\r\n", _configTime.dst);
  DEBUGASYNCWS("syncinterval: %d\r\n", _configTime.syncinterval);
  DEBUGASYNCWS("enablertc: %d\r\n", _configTime.enablertc);
  DEBUGASYNCWS("enablentp: %d\r\n", _configTime.enablentp);
  DEBUGASYNCWS("ntpserver_0: %s\r\n", _configTime.ntpserver_0);
  DEBUGASYNCWS("ntpserver_1: %s\r\n", _configTime.ntpserver_1);
  DEBUGASYNCWS("ntpserver_2: %s\r\n", _configTime.ntpserver_2);

  return true;
}

//*************************
// LOAD SHOLAT CONFIG
//*************************
bool load_config_sholat()
{
  DEBUGASYNCWS("\r\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");

#endif

  //strlcpy(_sholatConfig.location, _config.city, sizeof(_sholatConfig.location));
  //const char *city = _config.city;
  //_sholatConfig.city = city;
  // _sholatConfig.timezone = _configLocation.timezone;
  // _sholatConfig.latitude = _configLocation.latitude;
  // _sholatConfig.longitude = _configLocation.longitude;

