minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "w");
  root.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE CONFIG LEDMATRIX
//*************************
bool save_config_ledmatrix()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  uint8_t opmode = 0;

  if (_ledMatrixSettings.operatingmode == Normal)
  {
    opmode = 0;
  }
  else if (_ledMatrixSettings.operatingmode == Config)
  {
    opmode = 1;
  }
  else if (_ledMatrixSettings.operatingmode == Edit)
  {
    opmode = 2;
  }

  root[FPSTR(pgm_operatingmode)] = opmode;

  if (_ledMatrixSettings.pagemode == Automatic)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_automatic);
  }
  else if (_ledMatrixSettings.pagemode == Manual)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_manual);
  }

  root[FPSTR(pgm_pagemode0)] = _ledMatrixSettings.pagemode0;
  root[FPSTR(pgm_pagemode1)] = _ledMatrixSettings.pagemode1;
  root[FPSTR(pgm_pagemode2)] = _ledMatrixSettings.pagemode2;
  root[FPSTR(pgm_scrollrow_0)] = _ledMatrixSettings.scrollrow_0;
  root[FPSTR(pgm_scrollrow_1)] = _ledMatrixSettings.scrollrow_1;
  root[FPSTR(pgm_scrollspeed)] = _ledMatrixSettings.scrollspeed;
  root[FPSTR(pgm_brightness)] = _ledMatrixSettings.brightness;
  root[FPSTR(pgm_adzanwaittime)] = _ledMatrixSettings.adzanwaittime;
  root[FPSTR(pgm_iqamahwaittime)] = _ledMatrixSettings.iqamahwaittime;

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "w");
  root.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

// convert a single hex digit character to its integer value (from https://code.google.com/p/avr-netino/)
unsigned char h2int(char c)
{
  if (c >= '0' && c <= '9')
  {
    return ((unsigned char)c - '0');
  }
  if (c >= 'a' && c <= 'f')
  {
    return ((unsigned char)c - 'a' + 10);
  }
  if (c >= 'A' && c <= 'F')
  {
    return ((unsigned char)c - 'A' + 10);
  }
  return (0);
}

void load_running_text()
{
  File runningTextFile = SPIFFS.open(RUNNING_TEXT_FILE, "r");
  if (!runningTextFile)
  {
    DEBUGLOG("Failed to open running text file");
    //return F("failed");
    //    return false;
    return;
  }

  // this is going to get the number of bytes in the file and give us the value in an integer
  int fileSize = runningTextFile.size();
  //Serial.println(fileSize);
  //int chunkSize=1;
  int chunkSize = 512;
  //This is a character array to store a chunk of the file.
  //We'll store 1024 characters at a time
  // char contents[fileSize];
  char buf[chunkSize];
  int numberOfChunks = (fileSize / chunkSize) + 1;

  // int count = 0;
  int remainingChunks = fileSize;

  int16_t x1Temp, y1Temp;
  uint16_t wTemp, hTemp;

  wText = 0;

  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    runningTextFile.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  runningTextFile.close();

  //contents = "";
  //return contents;

  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  //return F("success");
}

void load_running_text_2()
{
  File runningTextFile = SPIFFS.open(RUNNING_TEXT_FILE_2, "r");
  if (!runningTextFile)
  {
    DEBUGLOG("Failed to open running text file");
    //return F("failed");
    //    return false;
    return;
  }

  // this is going to get the number of bytes in the file and give us the value in an integer
  int fileSize = runningTextFile.size();
  //Serial.println(fileSize);
  //int chunkSize=1;
  int chunkSize = 512;
  //This is a character array to store a chunk of the file.
  //We'll store 1024 characters at a time
  // char contents[fileSize];
  char buf[chunkSize];
  int numberOfChunks = (fileSize / chunkSize) + 1;

  // int count = 0;
  int remainingChunks = fileSize;

  int16_t x1Temp, y1Temp;
  uint16_t wTemp, hTemp;

  wText = 0;

  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    runningTextFile.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  runningTextFile.close();

  //contents = "";
  //return contents;

  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  //return F("success");
}

char *formatBytes(size_t bytes)
{
  static char buf[10];
  if (bytes < 1024)
  {
    itoa(bytes, buf, 10);
    strcat(buf, "B");
  }
  else if (bytes < (1024 * 1024))
  {
    itoa(bytes / 1024.0, buf, 10);
    strcat(buf, "KB");
  }
  else if (bytes < (1024 * 1024 * 1024))
  {
    itoa(bytes / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "MB");
  }
  else
  {
    itoa(bytes / 1024.0 / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "GB");
  }
  return buf;
}

bool loadHTTPAuth()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File configFile = SPIFFS.open(SECRET_FILE, "r");
  if (!configFile)
  {
    DEBUGASYNCWS("Failed to open secret file\r\n");
    _httpAuth.auth = false;
    _httpAuth.wwwUsername[0] = '\0';
    _httpAuth.wwwPassword[0] = '\0';
    configFile.close();
    return false;
  }

