minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  size_t size = configFile.size();

  // Allocate a buffer to store contents of the file.
  std::unique_ptr<char[]> buf(new char[size]);

  // We don't use String here because ArduinoJson library requires the input
  // buffer to be mutable. If you don't use ArduinoJson, you may as well
  // use configFile.readString instead.
  configFile.readBytes(buf.get(), size);
  configFile.close();
  DEBUGASYNCWS("JSON secret file size: %d bytes\r\n", size);
  DynamicJsonBuffer jsonBuffer;
  //StaticJsonBuffer<256> jsonBuffer;
  JsonObject &json = jsonBuffer.parseObject(buf.get());

  if (!json.success())
  {
#ifndef RELEASE
    //String temp;
    json.prettyPrintTo(DEBUGPORT);
    PRINT("\r\n");
    PRINT("Failed to parse secret file\r\n");
#endif // RELEASE
    _httpAuth.auth = false;
    return false;
  }
#ifndef RELEASE
  //String temp;
  json.prettyPrintTo(DEBUGPORT);
  PRINT("\r\n");
#endif // RELEASE

  _httpAuth.auth = json["auth"];
  strlcpy(_httpAuth.wwwUsername, json["user"], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, json["pass"], sizeof(_httpAuth.wwwPassword));

  if (_httpAuth.auth)
  {
    DEBUGASYNCWS("User: %s\r\n", _httpAuth.wwwUsername);
    DEBUGASYNCWS("Pass: %s\r\n", _httpAuth.wwwPassword);
  }

  return true;
}

void AsyncWSLoop()
{
  ArduinoOTA.handle();
  dnsServer.processNextRequest();

  if (resetESP)
  {
    resetESP = false;
    SPIFFS.end();                           // SPIFFS.end();
    tickerResetRestart.once(1.0f, reset_1); // Task to run periodic things every second
  }

  if (restartESP)
  {
    restartESP = false;
    SPIFFS.end();                             // SPIFFS.end();
    tickerResetRestart.once(1.0f, restart_1); // Task to run periodic things every second
  }

  if (tick1000ms)
  {
    if (firmwareUpdated)
    { // check the flag here to determine if a restart is required
      Serial.printf("Restarting ESP\n\r");
      firmwareUpdated = false;
      ESP.restart();
    }

    //if (ws.hasClient(clientID)) {
    if (ws.hasClient(clientID))
    {
      if (clientVisitStatusNetworkPage)
      {
        // WsSendInfoDynamic(clientID);
        // EventSendNetworkStatus();
        // WsSendNetworkStatus();
        sendNetworkStatus(2);
      }
      else if (clientVisitStatusTimePage)
      {
        //WsSendInfoDynamic(clientID);
        sendTimeStatus(2);
      }
      else if (clientVisitStatusSystemPage)
      {
        // WsSendInfoDynamic(clientID);
        // EventSendHeap();
        sendHeap(2);
        sendTimeStatus(2);
        // WsSendFsInfo();
      }
      else if (clientVisitSholatTimePage)
      {
        sendSholatSchedule(2);
      }
      else if (clientVisitConfigRunningLedPage)
      {
        // do nothing
      }
      else if (clientVisitConfigMqttPage)
      {
        // do nothing
      }
      else if (clientVisitSetTimePage)
      {
        // sendDateTime(1);
        sendDateTime(2);
      }
    }
    else
    {
      clientID = 0;
      clientVisitInfoPage = false;
      clientVisitSholatTimePage = false;
      clientVisitConfigRunningLedPage = false;
      clientVisitConfigMqttPage = false;
      clientVisitSetTimePage = false;
    }

    static char ssid_old[32];
    static char password_old[32];
    static bool dhcp_old;
    static char static_ip_old[16];
    static char netmask_old[16];
    static char gateway_old[16];
    static char dns0_old[16];
    static char dns1_old[16];

    static bool doOnce = true;
    if (doOnce)
    {
      doOnce = false;
      strlcpy(ssid_old, _config.ssid, sizeof(ssid_old));
      strlcpy(password_old, _config.password, sizeof(password_old));
      dhcp_old = _config.dhcp;
      strlcpy(static_ip_old, _config.static_ip, sizeof(static_ip_old));
      strlcpy(netmask_old, _config.netmask, sizeof(netmask_old));
      strlcpy(gateway_old, _config.gateway, sizeof(gateway_old));
      strlcpy(dns0_old, _config.dns0, sizeof(dns0_old));
      strlcpy(dns1_old, _config.dns1, sizeof(dns1_old));
    }

    if (configNetworkUpdatedFlag)
    {
      configNetworkUpdatedFlag = false;

      if (strcmp(ssid_old, _config.ssid) != 0 ||
          strcmp(password_old, _config.password) != 0 ||
          dhcp_old != _config.dhcp ||
          strcmp(static_ip_old, _config.static_ip) != 0 ||
          strcmp(netmask_old, _config.netmask) != 0 ||
          strcmp(gateway_old, _config.gateway) != 0 ||
          strcmp(dns0_old, _config.dns0) != 0 ||
          strcmp(dns1_old, _config.dns1) != 0)
      {

        PRINT("\r\n*** Network Settings Updated ***\r\nApllying new settings...\r\n\r\n");

        // update old values
        strlcpy(ssid_old, _config.ssid, sizeof(ssid_old));
        strlcpy(password_old, _config.password, sizeof(password_old));
        dhcp_old = _config.dhcp;
        strlcpy(static_ip_old, _config.static_ip, sizeof(static_ip_old));
        strlcpy(netmask_old, _config.netmask, sizeof(netmask_old));
        strlcpy(gateway_old, _config.gateway, sizeof(gateway_old));
        strlcpy(dns0_old, _config.dns0, sizeof(dns0_old));
        strlcpy(dns1_old, _config.dns1, sizeof(dns1_old));

        if (!_config.dhcp)
        {
          PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\r\n");
          WiFi.mode(WIFI_OFF);
          WiFi.mode(WIFI_STA);

          IPAddress static_ip;
          IPAddress gateway;
          IPAddress netmask;
          IPAddress dns0;
          IPAddress dns1;

          static_ip.fromString(_config.static_ip);
          gateway.fromString(_config.gateway);
          netmask.fromString(_config.netmask);
          dns0.fromString(_config.dns0);
          dns1.fromString(_config.dns1);

          WiFi.config(static_ip, gateway, netmask, dns0, dns1);
          WiFi.hostname(_config.hostname);
          WiFi.begin(_config.ssid, _config.password);
          // WiFi.waitForConnectResult();
        }
        else
        {
          if (_config.ssid)
          {
            WiFi.mode(WIFI_OFF);
            IPAddress zeroIp(0, 0, 0, 0);
            WiFi.config(zeroIp, zeroIp, zeroIp);
            WiFi.hostname(_config.hostname);
            WiFi.begin(_config.ssid, _config.password);
            // WiFi.waitForConnectResult();
          }
        }
      }
      else
      {
        if (WiFi.status() != WL_CONNECTED)
        {
          if (_config.ssid)
          {
            PRINT("\r\nApllying new NETWORK settings...\r\n\r\n");
            WiFi.mode(WIFI_OFF);
            IPAddress zeroIp(0, 0, 0, 0);
            WiFi.config(zeroIp, zeroIp, zeroIp);
            WiFi.hostname(_config.hostname);
            WiFi.begin(_config.ssid, _config.password);
            // WiFi.waitForConnectResult();
          }
        }
      }
    }
  }

