minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  if (wifiGotIpFlag)
  {
    wifiGotIpFlag = false;

    bool autoReconnect = true;
    WiFi.setAutoReconnect(autoReconnect);

    uint8_t mode = WiFi.getMode();
    if (mode == WIFI_AP)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP);
    }
    else if (mode == WIFI_STA)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_STA);
    }
    else if (mode == WIFI_AP_STA)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP_STA);
      PRINT("\r\nTurning Off Wifi Access Point...\r\n");
      WiFi.softAPdisconnect(true);
    }
    else if (mode == WIFI_OFF)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_OFF);
    }
    else
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_NA);
    }

    /*
    https://github.com/esp8266/Arduino/blob/4897e0006b5b0123a2fa31f67b14a3fff65ce561/libraries/ESP8266WiFi/src/include/wl_definitions.h

    typedef enum {
    WL_NO_SHIELD        = 255,   // for compatibility with WiFi Shield library
    WL_IDLE_STATUS      = 0,
    WL_NO_SSID_AVAIL    = 1,
    WL_SCAN_COMPLETED   = 2,
    WL_CONNECTED        = 3,
    WL_CONNECT_FAILED   = 4,
    WL_CONNECTION_LOST  = 5,
    WL_DISCONNECTED     = 6
    } wl_status_t;
  */
  }

  if (wifiDisconnectedFlag)
  {
    wifiDisconnectedFlag = false;

    // WiFi.reconnect();
    uint8_t client = WiFi.softAPgetStationNum();

    Serial.printf("\r\nStations connected to soft-AP = %d\r\n", client);

    if (!client)
    {
      WiFi.reconnect();
    }

    static bool apEnable = false;

    if (wifiDisconnectedSince == 0)
    {
      wifiDisconnectedSince = millis();
      apEnable = true;
    }

    if (apEnable == true && (int)((millis() - wifiDisconnectedSince) / 1000) >= 30)
    {
      PRINT("\r\nStarting Wifi Access Point...\r\n");
      // DEBUGPORT.printf_P(PSTR("\r\nStarting Wifi Access Point...\r\n"));
      apEnable = false;
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(_configAP.ssid, _configAP.password);
      WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
    }

    // PRINT("\r\nWifi disconnected for %d seconds\r\n", (int)((millis() - wifiDisconnectedSince) / 1000);
    DEBUGPORT.printf_P(PSTR("\r\nWifi disconnected for %d seconds\r\n"), (int)((millis() - wifiDisconnectedSince) / 1000));
  }

  if (stationConnectedFlag)
  {
    stationConnectedFlag = false;
  }

  if (stationDisconnectedFlag)
  {
    stationDisconnectedFlag = false;
    uint8_t client = WiFi.softAPgetStationNum();

    if (!client)
    {
      WiFi.reconnect();
    }
  }
}

void sendSholatSchedule(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_type)] = FPSTR(pgm_sholatdynamic);
  root[FPSTR(pgm_h)] = HOUR;
  root[FPSTR(pgm_m)] = MINUTE;
  root[FPSTR(pgm_s)] = SECOND;
  root[FPSTR(pgm_curr)] = sholatNameStr(CURRENTTIMEID);
  root[FPSTR(pgm_next)] = sholatNameStr(NEXTTIMEID);

  root[FPSTR(pgm_loc)] = _configLocation.city;
  //  root[FPSTR(pgm_day)] = dayNameStr(weekday(local_time()));
  //  root[FPSTR(pgm_date)] = getDateStr(local_time());
  root[FPSTR(pgm_fajr)] = sholatTimeArray[0];
  root[FPSTR(pgm_syuruq)] = sholatTimeArray[1];
  root[FPSTR(pgm_dhuhr)] = sholatTimeArray[2];
  root[FPSTR(pgm_ashr)] = sholatTimeArray[3];
  root[FPSTR(pgm_maghrib)] = sholatTimeArray[5];
  root[FPSTR(pgm_isya)] = sholatTimeArray[6];

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}